
Процедура АннулироватьПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Аннулировать;
КонецПроцедуры

Процедура ЭтоЗаявкаУКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЭтоЗаявкаУК;
КонецПроцедуры

Процедура ОтправкаУведомленияВДругуюСистемуОбработка(ТочкаМаршрутаБизнесПроцесса)
	ОтправитьОповещение("Прием заявки УК");	
КонецПроцедуры 

Процедура ОтправитьОповещение(Текст)
	
	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());

	АдресЗапроса = "bot1618335423:AAGOE4ZuhJ4rycaRyDeKtBEROre8_JsTShE/sendMessage?chat_id=1139990117&text="+Текст;
	ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса);

	Попытка
		СоединениеHTTP.Получить(ЗапросHTTP);             
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры 

Процедура ОзнакомлениеСОбращениемПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	КлючеваяОперация = "ПримерЗамераВремениСозданияЗадач";
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Секретарь");
	Для каждого Строка Из ФормируемыеЗадачи Цикл	
	    Строка.Пользователь = Пользователь;
		Строка.Аннулировать = Аннулировать;
		Строка.ЭтоЗаявкаУК = ЭтоЗаявкаУК;
		Строка.Телефон = Телефон;
		Строка.Дом = Дом;
		Строка.НомерКвартиры = НомерКвартиры;
		Строка.Почта = Почта;
		Строка.ФИО = ФИО;
		Строка.Описание = Описание;
	КонецЦикла; 
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени(КлючеваяОперация,ВремяНачала);
КонецПроцедуры

Процедура ОзнакомлениеСОбращениемПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ЗаявкаНаУстранениеГОПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)

	Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Служба ГО");
	Для каждого Строка Из ФормируемыеЗадачи Цикл	
	    Строка.Пользователь = Пользователь;
		Строка.Аннулировать = Аннулировать;
		Строка.ЭтоЗаявкаУК = ЭтоЗаявкаУК;
		Строка.Телефон = Телефон;
		Строка.Дом = Дом;
		Строка.НомерКвартиры = НомерКвартиры;
		Строка.Почта = Почта;
		Строка.ФИО = ФИО;
		Строка.Описание = Описание;
	КонецЦикла;

КонецПроцедуры

Процедура ОзнакомлениеСОбращениемПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Аннулировать = Задача.Аннулировать;
	ЭтоЗаявкаУК = Задача. ЭтоЗаявкаУК;
КонецПроцедуры
